In [2]:
import pandas as pd
import numpy as np

我们可以使用 .head() 和 .tail() 方法分别获得开头和结尾的部分

In [3]:
long_series = pd.Series(np.random.randn(10))
long_series

0   -1.141557
1   -0.780521
2    0.663787
3   -0.837540
4   -0.921029
5   -0.234231
6    1.011925
7   -0.788609
8   -0.237854
9   -1.519673
dtype: float64

In [5]:
long_series.head(3) #不指定参数默认返回5个

0   -1.141557
1   -0.780521
2    0.663787
dtype: float64

In [6]:
long_series.tail(2)

8   -0.237854
9   -1.519673
dtype: float64

In [8]:
index = pd.date_range("1/1/2000", periods=8)
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

                   A         B         C
2000-01-01 -0.486505  0.530778  0.414765
2000-01-02  0.766257  1.947108  2.126155
2000-01-03  1.275492 -0.548446  1.254496
2000-01-04  0.405497  2.133300  1.252856
2000-01-05 -1.136895  0.565784  0.538296
2000-01-06 -0.696530  0.363307 -0.375444
2000-01-07 -0.610915 -0.292868  0.378516
2000-01-08 -0.603599 -0.850498  0.218207

In [10]:
df.columns = [x.lower() for x in df.columns]
df

                   a         b         c
2000-01-01 -0.486505  0.530778  0.414765
2000-01-02  0.766257  1.947108  2.126155
2000-01-03  1.275492 -0.548446  1.254496
2000-01-04  0.405497  2.133300  1.252856
2000-01-05 -1.136895  0.565784  0.538296
2000-01-06 -0.696530  0.363307 -0.375444
2000-01-07 -0.610915 -0.292868  0.378516
2000-01-08 -0.603599 -0.850498  0.218207

In [13]:
ser = pd.Series(pd.date_range("2000", periods=2, tz="CET"))
ser

0   2000-01-01 00:00:00+01:00
1   2000-01-02 00:00:00+01:00
dtype: datetime64[ns, CET]

In [14]:
ser.to_numpy(dtype=object)

array([Timestamp('2000-01-01 00:00:00+0100', tz='CET'),
       Timestamp('2000-01-02 00:00:00+0100', tz='CET')], dtype=object)

In [15]:
df.to_numpy()

array([[-0.48650546,  0.53077845,  0.4147646 ],
       [ 0.76625671,  1.94710847,  2.1261552 ],
       [ 1.27549226, -0.54844583,  1.25449633],
       [ 0.40549714,  2.13330046,  1.25285628],
       [-1.13689532,  0.56578446,  0.53829628],
       [-0.6965301 ,  0.36330656, -0.3754443 ],
       [-0.6109151 , -0.2928678 ,  0.37851574],
       [-0.60359929, -0.85049819,  0.21820686]])

In [17]:
row = df.iloc[1]
df.sub(row,axis='columns') #减去索引为1的行，如果用的是列，则axis='index'
#等价于df.sub(row,axis=1)
#还有 .add()加 .mul()乘 .div()除 操作

                   a         b         c
2000-01-01 -1.252762 -1.416330 -1.711391
2000-01-02  0.000000  0.000000  0.000000
2000-01-03  0.509236 -2.495554 -0.871659
2000-01-04 -0.360760  0.186192 -0.873299
2000-01-05 -1.903152 -1.381324 -1.587859
2000-01-06 -1.462787 -1.583802 -2.501599
2000-01-07 -1.377172 -2.239976 -1.747639
2000-01-08 -1.369856 -2.797607 -1.907948

In [18]:
dfc = df.copy()
dfc

                   a         b         c
2000-01-01 -0.486505  0.530778  0.414765
2000-01-02  0.766257  1.947108  2.126155
2000-01-03  1.275492 -0.548446  1.254496
2000-01-04  0.405497  2.133300  1.252856
2000-01-05 -1.136895  0.565784  0.538296
2000-01-06 -0.696530  0.363307 -0.375444
2000-01-07 -0.610915 -0.292868  0.378516
2000-01-08 -0.603599 -0.850498  0.218207

In [25]:
dfq = pd.DataFrame(
    np.array([[1, 2, np.NaN], [4,np.NaN, 6], [7, 8, np.NaN]]),
    columns=['a', 'b', 'c'],
    index=['a','b','c']
)
dfq

     a    b    c
a  1.0  2.0  NaN
b  4.0  NaN  6.0
c  7.0  8.0  NaN

In [29]:
dfq+dfq['a'] #每一行都增加1.0 4.0 7.0，即使有不确定值也不碍事

     a     b     c
a  2.0   6.0   NaN
b  5.0   NaN  13.0
c  8.0  12.0   NaN

将两个相似的 DataFrame 结合

In [30]:
df1 = pd.DataFrame(
    {"A": [1.0, np.nan, 3.0, 5.0, np.nan], 
     "B": [np.nan, 2.0, 3.0, np.nan, 6.0]}
)
df2 = pd.DataFrame(
    {
        "A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],
        "B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],
    }
)

In [31]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [32]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [33]:
df1.combine_first(df2) 
#这样就将第一个数据和第二个数据结合起来，填补了第一个没有而第二个有的数据
#此外还补充了第二个有而第一个没有的数据

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [38]:
df.describe() #描述
#包括非空总计，均值，标准差等

              a         b         c
count  8.000000  8.000000  8.000000
mean  -0.135900  0.481058  0.725981
std    0.843685  1.091173  0.778387
min   -1.136895 -0.850498 -0.375444
25%   -0.632319 -0.356762  0.338439
50%   -0.545052  0.447043  0.476530
75%    0.495687  0.911115  1.253266
max    1.275492  2.133300  2.126155

In [41]:
df

                   a         b         c
2000-01-01 -0.486505  0.530778  0.414765
2000-01-02  0.766257  1.947108  2.126155
2000-01-03  1.275492 -0.548446  1.254496
2000-01-04  0.405497  2.133300  1.252856
2000-01-05 -1.136895  0.565784  0.538296
2000-01-06 -0.696530  0.363307 -0.375444
2000-01-07 -0.610915 -0.292868  0.378516
2000-01-08 -0.603599 -0.850498  0.218207

In [43]:
df.apply(np.mean,axis=1) #.apply() 就是按照括号中的指令对数据进行操作
#括号中的指令也可以是自己编写的一个函数
#.transform() 也有类似的效果

2000-01-01    0.153013
2000-01-02    1.613173
2000-01-03    0.660514
2000-01-04    1.263885
2000-01-05   -0.010938
2000-01-06   -0.236223
2000-01-07   -0.175089
2000-01-08   -0.411964
Freq: D, dtype: float64

In [48]:
sa = pd.Series(np.random.randn(5),index=["a", "b", "c", "d", "e"])
sa.reindex(['e','C','b','d','E']) 
#重新取索引，如果不是原来的索引，那就认为值缺失

e    0.786401
C         NaN
b   -0.900732
d   -1.494896
E         NaN
dtype: float64

对象的对齐

In [49]:
sc = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [52]:
s1 = sc[:4]
s1

a    0.820152
b    0.472464
c   -1.953783
d    1.593949
dtype: float64

In [51]:
s2 = sc[-4:]
s2

b    0.472464
c   -1.953783
d    1.593949
e   -0.127605
dtype: float64

In [53]:
s1.align(s2) #两个数据对齐，那么没出现的则为缺失
#参数2 join='outer' or 'left' or 'right' or 'inner'

(a    0.820152
 b    0.472464
 c   -1.953783
 d    1.593949
 e         NaN
 dtype: float64,
 a         NaN
 b    0.472464
 c   -1.953783
 d    1.593949
 e   -0.127605
 dtype: float64)

In [60]:
df.drop(['2000-01-04']) #丢弃某一行，默认axis=0，按行

                   a         b         c
2000-01-01 -0.486505  0.530778  0.414765
2000-01-02  0.766257  1.947108  2.126155
2000-01-03  1.275492 -0.548446  1.254496
2000-01-05 -1.136895  0.565784  0.538296
2000-01-06 -0.696530  0.363307 -0.375444
2000-01-07 -0.610915 -0.292868  0.378516
2000-01-08 -0.603599 -0.850498  0.218207

In [61]:
df.drop(['b'],axis=1)

                   a         c
2000-01-01 -0.486505  0.414765
2000-01-02  0.766257  2.126155
2000-01-03  1.275492  1.254496
2000-01-04  0.405497  1.252856
2000-01-05 -1.136895  0.538296
2000-01-06 -0.696530 -0.375444
2000-01-07 -0.610915  0.378516
2000-01-08 -0.603599  0.218207

In [63]:
for row,column in df.items():
    print(row)
    print(column)
    break

a
2000-01-01   -0.486505
2000-01-02    0.766257
2000-01-03    1.275492
2000-01-04    0.405497
2000-01-05   -1.136895
2000-01-06   -0.696530
2000-01-07   -0.610915
2000-01-08   -0.603599
Freq: D, Name: a, dtype: float64

按照 dtype 选择某一列

In [64]:
df = pd.DataFrame(
    {
        "string": list("abc"),
        "int64": list(range(1, 4)),
        "uint8": np.arange(3, 6).astype("u1"),
        "float64": np.arange(4.0, 7.0),
        "bool1": [True, False, True],
        "bool2": [False, True, False],
        "dates": pd.date_range("now", periods=3),
        "category": pd.Series(list("ABC")).astype("category"),
    }
)
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2022-01-24 11:49:43.139698,A
1,b,2,4,5.0,False,True,2022-01-25 11:49:43.139698,B
2,c,3,5,6.0,True,False,2022-01-26 11:49:43.139698,C

In [65]:
df.dtypes

string              object
int64                int64
uint8                uint8
float64            float64
bool1                 bool
bool2                 bool
dates       datetime64[ns]
category          category
dtype: object

In [69]:
df.select_dtypes(include=['object','float64'])

  string  float64
0      a      4.0
1      b      5.0
2      c      6.0